benchmark_results_20260202/actix_heavy.txt
Running 20s test @ http://127.0.0.1:8080/heavy
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   200.97ms   15.18ms 403.61ms   89.99%
    Req/Sec   124.23     13.50   160.00     58.25%
  4974 requests in 20.10s, 6.16GB read
Requests/sec:    247.44
Transfer/sec:    313.65MB